Repository: SyyDai/SyyBoard-ios-Manoonchai
Catalog: iosrmpkbd/Localizable.xcstrings
Source language: en
Languages: th

source: About
th: เกี่ยวกับ

# .accesibility
source: Accessibility
th: การช่วยการเข้าถึง

source: Apps
th: แอป

# .capslock_state_desc
source: state to type shifted characters instead.
th: แทนในการพิมพ์อักษรที่ต้องกดชิฟต์

# .delete_desc
source: to remove the last character in the keyboard input box; if empty it will send a deleteBackward action to that input field.
th: เพื่อลบอักษรล่าสุด หากไม่มี จะลบอักษรปลายทางแทน

source: Edit
th: แก้ไข

source: Enable
th: เปิดใช้งาน

# .enable_both
source: Enable both ‘Manoonchai’ and ‘Allow Full Access’.
th: เปิดใช้ทั้ง ‘Manoonchai’ และ ‘อนุญาตการเข้าถึงทั้งหมด’

source: Enable Keyboard
th: เปิดใช้งานแป้นพิมพ์

# .enable_keyboard_instruction
source: Enable this keyboard by going to:
th: เปิดใช้งานแป้นพิมพ์โดยการ

# .how_to_ios
source: Enable AssistiveTouch and turn on ‘Show On-Screen Keyboard’.
th: เปิดใช้งาน AssistiveTouch และเปิดใช้งานแสดงแป้นพิมพ์บนหน้าจอ

# .how_to_ios_step
source: Steps to force the on-screen keyboard to appear:
th: วิธีบังคับให้แสดงแป้นพิมพ์บนจอได้

# .how_to_ios_step_1
source: 1. Tap the input field you want to type in.
th: 1. เลือกช่อง input ที่ต้องการพิมพ์

# .how_to_ios_step_2
source: 2. If the keyboard doesn’t appear, go to the Home Screen.
th: 2. ถ้าแป้นพิมพ์ไม่แสดง ให้กลับไปหน้าจอโฮม

# .how_to_ios_step_3
source: 3. Return to the input field; the on-screen keyboard should appear.
th: 3. กลับมาที่ช่อง input แล้วแป้นพิมพ์บนจอควรแสดงขึ้นมา

# .how_to_ios_step_4
source: 4. If it still doesn’t appear, try locking the screen and repeating the steps.
th: 4. ถ้ายังไม่ได้ ลองล็อกหน้าจอแล้วทำใหม่

# .how_to_ipados18
source: iPadOS 18 : Use the button at the bottom-right corner to show the on-screen keyboard.
th: iPadOS 18: ใช้ปุ่มที่อยู่มุมล่างขวา แล้วเลือกแสดงแป้นพิมพ์บนหน้าจอ

# .how_to_ipados26
source: iPadOS 26+: If the button is missing, look at the
th: iPadOS 26: ถ้าปุ่มดังกล่าวไม่มี ให้มองหา

# .how_to_type
source: When the on-screen keyboard appears, touch “Click here to start typing…”. This lets WebView detect the hardware keyboard so you can type.
th: เมื่อแป้นพิมพ์บนจอแสดงขึ้นมา ให้แตะช่องข้อความ “Click here to start typing…” เพื่อให้ WebView จับแป้นพิมพ์ฮาร์ดแวร์เพื่อพิมพ์ได้

# .how_to_type_note
source: DO NOT TYPE WHILE THE INPUT FIELD IN THE DESTINATION APP IS FOCUSED AND THE INPUT BOX IN WebView IS NOT FOCUSED, AS IT WILL HIDE THE ON-SCREEN KEYBOARD.
th: ห้ามพิมพ์ขณะที่ช่องป้อนข้อมูลในแอปปลายทางถูกโฟกัส และช่องป้อนข้อมูลใน WebView ยังไม่ถูกโฟกัส เพราะจะทำให้คีย์บอร์ดบนหน้าจอหายไป

source: How to use
th: วิธีใช้

# .how_to_use_title
source: How to use keyboard
th: วิธีใช้แป้นพิมพ์

source: Keyboards
th: แป้นพิมพ์

# .keys_title
source: Keys:
th: ปุ่ม:

source: Menubar
th: เมนูบาร์

# .note_title
source: NOTE:
th: หมายเหตุ:

source: Open App Setting
th: เปิดตั้งค่าแอป

# .open_website_discord
source: Join Manoonchai Discord Server
th: เข้าร่วมเซิร์ฟดิสแป้นมนูญชัย

# .open_website_sourcecode
source: Source code on GitHub
th: Source code บน GitHub

source: Press
th: กด

# .privacy_policy_desc
source: Everything you type stays on your device; we don’t collect or share it.
th: ทุกข้อความที่คุณพิมพ์อยู่บนอุปกรณ์ของคุณ เราไม่เก็บหรือส่งต่อข้อมูลใด ๆ

# .privacy_policy_title
source: Privacy Policy
th: นโยบายความเป็นส่วนตัว

# .return_desc
source: to send text to that input field; if empty it will send a newline or a Return.
th: เพื่อส่งข้อความไปปลายทาง หากไม่มี จะส่ง Return หรือขึ้นบรรทัดใหม่

source: Settings
th: ตั้งค่า

# .shift_option_desc
source: keys do not work. We don't know why.
th: ไม่ทำงาน เราก็ไม่รู้เหมือนกันว่าทำไม

source: Show Keyboard
th: แสดงแป้นพิมพ์

# .sometimes_shift_option
source: Sometimes,
th: บางครั้ง

# .space_desc
source: to also send text to that input field but with a space at the end.
th: เพื่อส่งข้อความไปปลายทางเหมือนกัน แต่จะมีช่องว่างต่อท้ายไปด้วย

# .space_key
source: SPACE
th: Spacebar

# .support_title
source: Support:
th: รองรับ:

# .tab_desc
source: to switch between your last 2 used layouts (or ‘aก’ on screen).
th: เพื่อสลับแป้นพิมพ์ที่เลือกใช้ล่าสุด 2 อัน (หรือกด ‘aก’ บนจอ)

# .test_keyboard_here
source: Typing here…
th: พิมพ์ที่นี่

# .test_keyboard_title
source: Test keyboard:
th: ทดสอบแป้นพิมพ์:

source: Touch
th: สัมผัส

# .use_capslock
source: Use
th: ให้ใช้สถานะ

source: Key
th: คีย์
